[{"name":"Repeat-After-Me Songs","outcomes":["Affection for Others","Sense of Community"],"concept":"Icebreakers and Energizers","supplies":"None","time":"No Limit","groupsize":"Medium to Large","goal":"Participants get excited, let loose, and crazy. Gets people out of comfort zone while everyone else is as well.","facilitation":["BE LOUD, ENERGETIC, and CRAZY","Everyone gets in circle with the facilitator in the middle.","Sing the song and have everyone else follow suit.","The variety of songs to choose from:"],"songs":{"Boom Chicka Boom":["“This is a REPEAT-AFTER-ME song!”","I said a boom chicka boom (echo)","I said a boom chicka boom (echo)","I said a boom chicka Rocka chicka Rocka chicka boom (echo)","Oh yeah (echo)","Uh huh (echo)","","One more time (echo)","___________ style (echo)","","*Different styles: Loud, Whisper, Southern, Valley Girl, Opera, Attitude, British, Rocket, Harley, Janitorial, Teacher."],"Coast to Coast":["“This is a REPEAT-AFTER-ME song!”","From coast to coast, (Repeat)","STLF is the most. (Repeat)","From Coast to coast (Repeat)","STLF is the most. (Repeat)","Na na na na na (Repeat)","Na na na na na na (Repeat)","Na na na na na na na (Repeat)","Na na na na na (Repeat)","","From East to West, STLF is the best","From State to state, STLF is really great","From City to City, STLF is really pretty","From Town to town, STLF is getting down ETC ETC ETC"],"Brown Squirrel":["Brown Squirrel, Brown Squirrel,","Shake your bushy tail!","Brown Squirrel, Brown Squirrel,","Shake your bushy tail!","Take a peanut from your hand...","(Shout) AND SHOVE IT UP YOUR NOSE!!!","Brown Squirrel, Brown Squirrel,","Shake your bushy tail!","","*When saying \"brown squirrel\" make bowing action with arms. When saying \"shake your bushy tail\" turn around and shake your bottom.","When saying \"Take a peanut from your hand\" pretend to take a peanut from your hand.","When saying \"AND SHOVE IT UP YOUR NOSE!\" pretend to shove the peanut up your nose."],"Baby Shark":["Baby shark do do, do do do do","Baby shark do do, do do do do","Baby shark do do, do do do do","Baby shark","","*Repeat with using appropriate actions","Mama Shark","Papa Shark","Grandma Shark","Saw a shark","Swam away","Shark attack","Lost a Leg","Rescue Boat"],"Princess Pat":["“This is a REPEAT-AFTER-ME song!”","The Princess Pat (Egyptian style)","Lived in a Tree (roof over head)","She Sailed across (ocean motion)","The seven seas (hold up 7 fingers; make C with hand)","She sailed across (ocean motion)","The channel two (hold up 2 fingers)","and she took with her (both hands over shoulder like holding a bag)","Arrigabamboo (shake booty all the way down)","","Arrigabamboo (shake booty all the way down)","Now What is that? (shrug)","It's something made (bang hands together)","by the Princess Pat (Egyptian style)","It's red and gold (Twirl hand around like you're waving a string at your waist)","And purple too (bring your voice up. point high)","That's why it's called (Get loud; cup hands around mouth)","Arrigabamboo (shake booty all the way down)","","Now the Captain Jack (strong man)","Had a mighty fine crew (salute X 2)","He sailed across (ocean motion)","The channel two (hold up 2 fingers)","But his ship sank (Hold nose and sink down)","and yours will too (point finger and shake hand in scolding motion)","If you don't take (both hands over shoulder like holding a bag)","Arrigabamboo (shake booty all the way down)","","Arrigabamboo (shake booty all the way down)","Now What is that? (shrug)","It's something made (bang hands together)","by the Princess Pat (Egyptian style)","It's red and gold (Twirl hand around like you're waving a string at your waist)","And purple too (bring your voice up.point high)","That's why it's called (Get loud; cup hands around mouth)","Arrigabamboo (shake booty all the way down)"],"There Was a Great Big Moose":["“This is a REPEAT-AFTER-ME song!”","There was a great big moose!","He liked to drink a lot of juice.","There was a great big moose!","He liked to drink a lot of juice.","Singin' oh way oh","Way oh way oh way oh way oh","Way oh way oh","Way oh way oh way oh way oh","","The moose's name was Fred.","He liked to drink his juice in bed.","The moose's name was Fred.","He liked to drink his juice in bed.","Singin' oh way oh","Way oh way oh way oh way oh","Way oh way oh","Way oh way oh way oh way oh","","He drank his juice with care,","but he spilled some in his hair.","He drank his juice with care,","but he spilled some in his hair.","Singin' oh way oh","Way oh way oh way oh way oh","Way oh way oh","Way oh way oh way oh way oh","Now he's a sticky moose … Full of juice ( SHOUTS) … And on the loooooose"],"Rumba Rumba":["“This is a REPEAT-AFTER-ME song!”","Rumba Rumba","A tiki tiki tonga","A wasa wasa wasa","O lay O lay O lay a wasa","(Faster and faster)"],"Wiggalo":["Hey ___ (call out to someone)","Hey what?","Are you ready?","For what?","To Wig?","Wig what?","Wiggalo!","You put your hands up high","Your feet down low","Thats the way you wiggalo (Do a dance move move)","Everyone repeats then passes to next person"],"Milk Song":["Give me a long M","M..................","Give me a short m","M","don't want no pop no pop","don't want no tea no tea","just give me milk","moo moo moo moo (one person sticks out thumbs and another pulls them as if milking a cow)","Wisconsin milk","moo moo moo moo","Give me a long I","I.................","Give me a short i","I","don't want no pop no pop","don't want no tea no tea","just give me milk","moo moo moo moo (one person sticks out thumbs and another pulls them as if milking a cow)","Wisconsin milk","moo moo moo moo","Give me a long L","L................","give me a short L","L","don't want no pop no pop","don't want no tea no tea","just give me milk","moo moo moo moo (one person sticks out thumbs and another pulls them as if milking a cow)","Wisconsin milk","moo moo moo moo","Give me a long K","K....................","give me a short k","K","don't want no pop no pop","don't want no tea no tea","just give me milk","moo moo moo moo (one person sticks out thumbs and another pulls them as if milking a cow)","Wisconsin milk","moo moo moo moo","Give me a long milk","CHOCOLATE","give me a short milk","SKIM","don't want no pop no pop","don't want no tea no tea","just give me milk","moo moo moo moo (one person sticks out thumbs and another pulls them as if milking a cow)","Wisconsin milk","moo moo moo moo"]}},{"name":"Hot Seat","outcomes":["Affection for Others","Sense of Community","Sense of Individuality"],"concept":"Icebreakers and Energizers","supplies":"None","time":"Approximately 5 minutes per person","groupsize":"Around 5 per group (many groups)","goal":"Participants learn more about each other and connect on a personal level. Participants learn to become open with the group. Participants become actively involved in the facilitation of the activity.","facilitation":["Participants break off into groups of around 5 people","One participant starts in the “Hot Seat”","Everybody else in the circle rapid fires questions at the person in the “Hot Seat”. The individual in the “Hot Seat” can opt not to answer certain questions at own disgression. There can’t be follow-up questions immediately after the previous question is asked and answered.","It goes until the timer says “time” and then a new person is in the “Hot Seat”.","Everyone is in the “Hot Seat” and then the game is over."]},{"name":"Electricity","outcomes":["Sense of Community","Affection for Others"],"concept":"Icebreakers and Energizers","supplies":"An object (something to grab\/touch), a coin","time":"No Limit","groupsize":"Large","goal":"Participants learn to cooperate with each other, have fun, and reinforce communication skills. LET OFF STEAM!!","facilitation":["Participants partner off and face each other while forming two lines.","Hold hands with the people on your side, thus your partner is on the other side","Facilitator is on one end with the coin","One person at the beginning of the line from each team by the facilitator has their eyes open while everyone else’s are closed.","The facilitator flips the coin continuously until it lands on ‘heads’. In silence, the person at the beginning of the line must squeeze the hand of the person next to him\/her. This generates an ‘electric current’ of sorts all the way through to the end of the line.","The persons at the end of each line race to an object once he\/she receives a squeeze. The person to get the object first gains a point.","The lines shift with the person at the beginning moving to the back and everyone else moving forward one. It keeps going until every gets to go or a certain number of points are gained.","In the event of a fault squeeze, the team loses a point."]},{"name":"Hovda","outcomes":["Affection for Others","Sense of Community"],"concept":"Icebreakers and Energizers","supplies":"None","time":"No Limit (it will end itself)","groupsize":"Large","goal":"It gets people moving, having fun, and interacting with peers. People will become competitive, develop strategies, and get rid of some energy.","facilitation":["The facilitator demonstrates each number\/action before the game begins by getting volunteers from the group.","Each number correlates with an action
- 2 = birdie on a perch, carrying like a baby OR sitting on one knee.
- 3 = teeter totter, one person in the middle with the others teeter tottering on each side going up and down
- 4 = train, person in front must CHOO CHOO with caboose bending over
- 5 = merry go round, one in the middle with hands up, four others circling like a merry go round.
- 6 = minivan, driver and navigator (with map) in the front, two annoying kids fighting in the middle, last two are sleeping on the road trip.","Everyone is in one big group. People move around singing “mingle, mingle, mingle” continuously until the facilitator yells out a number. The number called refers to the amount of people needed in each group and is associated with an action.","People are eliminated if they aren’t in a group doing an action with the correct amount of people. The ones no longer in the game go off to the side and cheer.","The game continues until there are two people left or until the facilitator decides to call off the game. The people remaining are declared the winners!"]},{"name":"High-Five Unique Trait","outcomes":["Affection for Others","Public Speaking","Sense of Community","Social Awareness"],"concept":"Icebreakers and Energizers","supplies":"None","time":"No Limit","groupsize":"Medium to Large","goal":"Participants learn more about each other and connect on a personal level. Participants learn to become open with the group. Participants become actively involved in the facilitation of the activity.","facilitation":["Everyone creates a large circle with one person in the middle.","The individual says something unique about themselves. People in the circle who share the same trait raise their hand. The individual in the middle high-five’s everyone who has their hand up.","The individual in the middle stays in the middle until he\/she says a trait that no one else in the circle also has. The individual then picks someone else to be in the middle.","The game keeps going until the facilitator feels like the activity should be finished based on energy, time, interest."]},{"name":"Flash","outcomes":["Social Awareness","Affection for Others","Sense of Community"],"concept":"Icebreakers and Energizers","supplies":"None","time":"No limit","groupsize":"Any","goal":"Participants learn more about each other and connect on a personal level. Participants learn to become open with the group. Participants become actively involved in the facilitation of the activity.","facilitation":["Participants form a circle.","One participant begins by asking a question.","Everybody goes around the circle and answers the question. The participant that asked the question answers it last. In true Flash style, questions should be quick and the answers should be quicker. However, if you’d like this to be a little deeper activity, be prepared to allow additional discussion.","The next person in the circle asks a question.","Repeat steps three and four as long as you’d like.","Before you end the activity, tell the group, “We’ll do three more questions, so make ‘em count!” If time permits, allow everybody in the circle to ask a question."]},{"name":"Classic Name Game","outcomes":["Affection for Others","Sense of Community"],"concept":"Icebreakers and Energizers","supplies":"None","time":"20 minutes","groupsize":"At least ten, less than 35","goal":"Participants learn the names of fellow group members.","note":"This activity could frustrate a lot of participants, but it is particularly effective in learning names, especially for the facilitator.","facilitation":["Participants form a circle.","One participant begins by saying their name with an adjective that describes them starting with the same letter or sound as their name (Jumping Jack, Shy Sarah, Crazy Kyle, Nice Nicole).","The next participant says the name of the person that came before them and then their name.","The next participant says the names of the two people that came before them and then their name.","The activity continues until the last participant says the names of everyone that came before them.","If a participant is having trouble remembering somebody’s name or adjective, or if they are trouble coming up with an adjective for themselves, allow other group members to help."],"alterations":["Instead of adjectives and names, you can use names with other characteristics, such as their favorite place to eat or what they brought on the bus (Jack brought a deck of cards, Sarah brought photo album, Kyle brought a journal, and Nicole brought some snacks)."]},{"name":"Question Ball","outcomes":["Affection for Others","Sense of Community"],"concept":"Icebreakers and Energizers","supplies":"A question ball (a ball with questions written on it)","time":"No limit","groupsize":"Any","goal":"Participants learn more about each other and connect on a personal level. Participants learn to become open with the group.","facilitation":["Participants form a circle.","Throw someone the question ball.","When they catch it, they should answer the question on their right thumb.","Tell the group that this is a “Challenge by Choice” activity. If they do not feel comfortable with the question on their right thumb, they have the right to throw it up to themselves and get a new question.","After they answer the question, they should throw the ball to someone else.","Repeat steps three, four, and five as long as you’d like.","Before you end the activity, tell the group, “We’ll do three more questions, so make ‘em count!”"]},{"name":"Channel Surfing","outcomes":["Affection for Others","Leadership Skills","Sense of Community"],"concept":"Icebreakers and Energizers","supplies":"None that are absolutely needed, but if you have a whiteboard, chalkboard, or piece of large poster paper, that would help.","time":"15 minutes","groupsize":"Medium to large","goal":"Participants learn more about each other and connect on a personal level. Participants learn to become open with the group. Participants speak in front of the entire crowd without realizing it","facilitation":["Before beginning the activity, identify some questions. Some good ones include: (a) Name \/\/ Year in School \/\/ Major, (b) Pet Peeves, (c) What EXCITES You, and (d) If you were on MTV’s “Made,” what would your goal be. If you have a whiteboard, chalkboard, or poster board, write the questions large enough so that everyone in the room can see.","Line the participants up “lecture hall style” with rows of seats (or sit on the floor in rows) all facing forward. If you have a whiteboard, chalkboard, or poster board, the participants should be facing it.","Three to five volunteers should come up to the front and face the front standing in the same direction as the seated participants.","Read the participants the questions.","When the activity begins, one of the volunteer participants will turn around and begin answering the questions. The volunteer will need to speak fast, and go for as long as possible.","Whenever one of the other volunteers feels like it, they should turn around and cut off the speaking volunteer. The speaking volunteer should then turn back around and face away from the crowd. The new speaking volunteer should also try to speak fast and for as long as possible.","Repeat step six. When somebody who used to speak turns back around, they should continue speaking from the same point they left off at (hence… Channel Surfing).","When one of the volunteers finishes speaking, they should run back to their seat and somebody new should run to the front.","Allow the activity to continue until all participants have had a chance to be up front."],"alterations":["Instead of having a random person run up after someone sits down, have the person who just finished tag someone new to go to the front. When someone finishes, everybody who hasn’t been to the front yet should raise their hand for a high five.","As a second alteration, set three to five questions for everyone (just like in step one). In addition, give each participant their own unique question on an index card or scrap of paper. When you write out the questions, write “Index Card Question” as the last question."]},{"name":"Orientation Upset (AKA “All My Friends”)","outcomes":["Affection for Others","Sense of Community"],"concept":"Icebreakers and Energizers","supplies":"None that are absolutely needed, but having seats would be ideal.","time":"No limit","groupsize":"At least ten","goal":"Participants learn more about each other and connect on a personal level. Participants learn to become open with the group.","note":"This activity is highly mobile… Make sure that everybody in your group can participate!","facilitation":["Participants form a circle. There should be one less spot then people. If you have chairs, a chair can be a spot. Otherwise, have one person stand out (usually the facilitator) and tell the participants that they are standing on a “spot.”","The one person out should be in the middle of the circle. They should say, “All my friends…” and something about themselves. For example, “All my friends used to play baseball.” Point out to the participants that this does not literally mean that all of his or her friends used to play baseball, but that they themselves used to play baseball.","If anybody in the outside circle also used to play baseball, they should get up and move to a different spot. They should not move to the spot directly to their right or left.","The person in the middle may need to say several characteristics before somebody agrees. That’s okay! They’re just unique, and we just get the opportunity to learn more about them!","As participants move, the person in the middle should try to steal a spot before someone else gets there. Then, the person without a spot is the new person in the middle.","Tell the group that if, at any time, you (as the facilitator) yell out “Orientation Upset!,” everybody must switch places. Use this as a tool when a very shy participant ends up in the middle and would be extremely uncomfortable if you don’t “bail ‘em out,” or with a participant that is being inappropriate (i.e. “All my friends like to get drunk”).","Repeat steps two through six as long as you’d like.","Before you end the activity, tell the group, “We’ll do three more questions, so make ‘em count!”"]},{"name":"Two Truths and a Lie","outcomes":["Affection for Others","Sense of Community"],"concept":"Icebreakers and Energizers","supplies":"None","time":"No limit","groupsize":"Any","goal":"Participants learn more about each other and connect on a personal level. Participants learn to become open with the group. Participants become actively involved with the facilitation of the activity.","facilitation":["Participants take turns sharing three interesting “facts” about themselves. Two of these should be true, and one (randomly) should be made up.","Other participants try to guess which one of the facts was a lie.","The participant reveals the correct answer, and then the next participant gives their three facts.","Allow the activity to continue until all participants have gone."]},{"name":"Never Have I Ever","outcomes":["Affection for Others","Sense of Community"],"concept":"Icebreakers and Energizers","supplies":"None","time":"No limit","groupsize":"Any","goal":"Participants learn more about each other and connect on a personal level. Participants learn to become open with the group. Participants become actively involved in the facilitation of the activity.","note":"Be careful when you select this activity! It often leads to very mature responses, and you don’t want to open a can of worms! This activity is great when you play it with close friends or if you are working with a very mature crowd. You wouldn’t want to attempt this activity unless you feel confident in your audience and your facilitation skills.","facilitation":["Participants form a circle.","Participants begin by holding up a certain number of fingers (five to ten).","One participants begins by saying “Never have I ever…” and finishing the statement with something they have, in fact, never done. For example, “Never have I ever been out of the state.”","Any participant that has done that activity puts down one finger. In this example, if you have been outside of the state, you would lower one finger.","Going around the circle, repeat steps three and four.","When a participant lowers all of their fingers, they are out.","Continue the game until one person wins, or until time allows."]},{"name":"Stare Down Switch","outcomes":["Sense of Community"],"concept":"Icebreakers and Energizers","supplies":"None that are absolutely needed, but having seats would be ideal.","time":"No limit","groupsize":"At least ten","goal":"Just for fun!","note":"This activity is highly mobile… Make sure that everybody in you group can participate! Also, tell the group before you begin that they will be running around a little bit, and that they may be bumping into one another. Just remind them to take it easy.","facilitation":["Participants form a circle. There should be one less spot than people. If you have chairs, a chair can be a spot. Otherwise, have one person stand out (usually the facilitator) and tell the participants that they are standing in a “spot.” The one person out should be in the middle of the circle.","Once the game begins, everybody on the outside of the circle should look at each other while the person in the middle scans everybody else.","Once two people on the outer circle establish eye contact, they should try to switch spots.","As participants move, the person in the middle should try to steal a spot before someone else gets there. Then, the person without a spot is the new person in the middle.","The activity can repeat as long as the facilitator would like."]},{"name":"Scream and Sit\/Screaming Feet","outcomes":["Sense of Community"],"concept":"Icebreakers and Energizers","supplies":"None","time":"5 minutes","groupsize":"At least ten","goal":"Participants get a little loud and let off a little bit of steam!","facilitation":["Participants form a circle. There are no backseats to the circle!","Everybody should look down.","When you (the facilitator) says, “One… Two… Three… Go!,” everybody should look up at one other person.","The goal of this activity is to look up at somebody who is looking at somebody else. If you look up and somebody is looking back at you, scream loudly and dramatically and sit down. You’re out!","If you would like to use this activity as an icebreaker, have participants yell the name of the person they are looking at when they are eliminated.","The activity continues until there are two participants, one participant, or no participants left."]},{"name":"Thumper","outcomes":["Sense of Community"],"concept":"Icebreakers and Energizers","supplies":"None","time":"No limit","groupsize":"At least ten, less than 25","goal":"Participants let off a little steam!","note":"Apparently, somebody has adapted this game into a drinking game. If, when you begin to explain this activity, somebody says, “Hey! I know this game! This is a drinking game!,” be prepared to respond with something like, “Ohh… I don’t like that. We’re going to play the sober version!”","facilitation":["Participants form a circle.","Each player identifies a hand motion. For example, the “snap in Z formation,” the “elephant nose,” the “rock star hand” etc.","Go around the circle and have everybody demonstrate their hand motion.","To begin the activity, everybody begins patting their laps or desks to create a drum roll. This drum roll continues for the duration of the round.","One participant starts by yelling, “What’s the name of the game?!?!” Everybody else should yell, “Thumper!” The participant will yell, “How do you play?!?!” Everybody should yell, “Fast!” The participant should yell, “How fast?!?!” Everybody should yell, “Real fast!”","The participant then, quickly, performs their hand motion and the hand motion of another participant. By doing this, they are essentially “passing” to somebody else in the circle. Everybody else should continue with the drum roll. When the participant finishes the hand motions, they will join back into the drum roll.","This new participant repeat steps six.","This continues until somebody messes up.","Repeat steps four through eight. The participant who messed up starts the next round in step five.","The activity continues as long as the facilitator would like."]},{"name":"Dippity Dippity Dip (Also done as ‘Boppity Bop Bop’)","outcomes":["Sense of Community"],"concept":"Icebreakers and Energizers","supplies":"None","time":"No limit","groupsize":"Any","goal":"Participants let off a little steam!","facilitation":["Participants form a circle.","One participant (usually the facilitator) goes in the center of the circle.","This person puts both of their hands together (as if to play patty cake with themselves) and points their fingers up, elbows out. Then they say “dippity dippity dip.” As they say each “dippity,” they should lower their hands\/elbows straight up and down. As they say “dip,” they should thrust forward with one foot and enthusiastically point (using their hands, still together) at another participant in the outer circle. By doing this, they have essentially “passed” to another participant.","The new participant should then repeat step three, passing it to another person.","The two people next to the person saying “dippity dippity dip” should each put their hands together (as if to play patter cake with themselves) and point to the person. They should say “dip dip dip” and put their hands down (like they’re pouring tea) each time they say “dip.” They should do this while the person is saying “dippity dippity dip.” If the person in the middle is the person saying “dippity dippity dip,” everybody in the outer circle says “dip dip dip” with the hand motion.","Instead of pointing to another participant for “dip,” the person saying “dippity dippity dip” may also point straight up in the air. If he or she does this, everybody says “dip dip dip” with their hands patty-caked straight up in the air as they jump in place in a circle. Then the person who last said “dippity dippity dip” still has it.","When anybody messes up, they are the new participant in the circle.","Repeat steps two through seven.","The activity can continue as long as the facilitator would like."]},{"name":"Big Booty","outcomes":["Sense of Community"],"concept":"Icebreakers and Energizers","supplies":"None","time":"No limit","groupsize":"About seven to twelve","goal":"Participants let off a little steam!","facilitation":["Participants form a circle.","One participant should be identified as “Big Booty.” Then, going clockwise around the circle, the next person is “Booty Number One,” “Booty Number Two,” “Booty Number Three,” etc.","Everybody sings the following while they keep a beat by patting their thighs then clapping: “Ahhhhh… Big Booty! Big Booty, Big Booty, Big Booty! Uh-Huh! Big Booty!” The thigh-clap beat continues throughout the entire round.","Big Booty says, “Big Booty, Number…” and then the number of one of the other participants. By doing this, they have essentially passed to another participant.","The new participant should say their number and the number of another participant (“Number Three, Number One”). They can also pass it back to Big Booty (“Number Three, Big Booty”). Participants can also stall by repeating their number (“Number Three, Number Three, Number Three, Number One”). The important thing is that participants remain on beat!","If any participant messes up, they go to the end of the line. Participants following the participants who messed up will thus get a new number.","Make sure everyone knows their (new) number.","Repeat steps two through seven. The goal is to be Big Booty!","The activity can repeat as long as the facilitator would like!"]},{"name":"Chitty Chitty Bang Bang","outcomes":["Sense of Community"],"concept":"Icebreakers and Energizers","supplies":"None","time":"No limit","groupsize":"About seven to twelve","goal":"Participants let off a little steam!","facilitation":["Participants form a circle.","One participant starts a rhythm\/dance. They will sing “Chitty Chitty Bang Bang, Bang Bang” as they maintain the rhythm. “Chitty Chitty Bang Bang, Bang Bang” can be considered a measure.","The next participant in the circle repeats the rhythm\/dance on the very next beat. While they do this, the original participant starts a new beat.","The third participant in the circle then starts the original rhythm. The second participant starts the second rhythm. The original participant will start a third rhythm.","This pattern of “passing the rhythm” continues until somebody messes up.","Any participant can start the next round.","The activity can continue as long as the facilitator would like."]},{"name":"High Five Rally","outcomes":["Sense of Community"],"concept":"Icebreakers and Energizers","supplies":"None","time":"5 minutes","groupsize":"At least ten","goal":"Participants let off a little steam!","facilitation":["Participants find a partner.","Participants high five with their right hand, then clap, then high five with their left hand, then clap, then go to high five with both hands, but stop right before their hands hit.","Participants have a couple minutes to try to repeat steps one and two with a many people as possible. Have participants count as they go.","After the time limit, if you’d like, have participants try again and beat their “record.”"]},{"name":"Trust-Builder Circle","outcomes":["Collective Action","Sense of Community"],"concept":"Team Builders","supplies":"Chairs for every participant","time":"15-20 minutes","groupsize":"20+ (Good activity for big groups)","goal":"Participants experience a sense of community and dependence on one another. Physical touch, breaks comfort zones. Participant experiences since of individual importance within the group.","facilitation":["Have all the students form a circle seated on chairs.","Have every student rotate to the right (their bodies – chairs remain stationary) and lay down on the knees of the person behind them.","Remove chairs intermittently until entire circle is supported only by the participants.","Remind students to support each other! If one falls, the entire circle collapses."]},{"name":"Song Wars","outcomes":["Leadership Skills","Collective Action"],"concept":"Team Builders","supplies":"None","time":"No Limit","groupsize":"At least two groups of 5-8 (more fun with more teams)","goal":"Participants learn more about each other and contact on a personal level.","facilitation":["Distribute teams throughout the room.","Facilitator gives the entire group one word (boy, girl, love, happy, dream for example)","Each group must sing a known song with the word given by the facilitator. The turns simply go in clockwise order around the room, so groups know when to have their song ready. Cannot repeat a song sung by another group. Must start the song within ten seconds.of the beginning of their turn. If they break these rules, the team sits down – last team standing wins!"]},{"name":"Star Power","outcomes":["Leadership Skills","Affection for Others","Social Cognition","Collective Action","Sense of Community"],"concept":"Team Builders","supplies":"Rope","time":"10 minutes","groupsize":"Large","goal":"Participants learn to cooperate with each other, have fun, and reinforce communication skills.","facilitation":["Assemble the group into a line or circle.","Have all participants pick up the rope.","Participants can move their hands along the rope, but they cannot change places with each other, and they must always be holding the rope.","Participants must form a five-pointed star with the rope in ten minutes with no rope left over at either end. The star may be just the outline of a star or one in which the lines cross over each other.","Some groups will finish this very quickly. If time permits, have participants form different shapes.","Debrief and reflect!"],"debrief":["How does this activity relate to teamwork? (We had to cooperate; We had to agree on things; We had to support the final outcome; We had to listen to each other; etc.)","How did you deal with everyone’s ideas about the way to proceed?","Did anyone emerge as the leader? How did they function?","How did you handle disagreements?","What implications does this have for us back on campus?"]},{"name":"Classic “Ice Breaker”","outcomes":["Leadership Skills","Social Cognition","Civic Efficacy","Sense of Community"],"concept":"Team Builders","supplies":"Two blocks of ice with a shirt inside each one (make at least twenty-four hours in advance, put one shirt in each of two quart size freezer bags; fill the freezer bags with water and leave them in the freezer; when the bags freeze, cut the bags open, leaving just the blocks of ice and tee shirts.","time":"20 minutes","groupsize":"At least ten, less than forty","goal":"Participants learn to work together towards a common goal requiring teamwork, strength, persistence, and strategy.","note":"Use old shirts… They’ll be ruined!","facilitation":["Participants are divided into two teams.","Each team is given a block of ice with a shirt frozen inside of it.","Teams compete to be the first team to remove the shirt from the block of ice and have somebody from the team put on the tee shirt.","Each participant must participate in some way in removing or wearing the shirt.","Participants may not use liquids in removing the shirt."],"alterations":["If you have more time and want an additional challenge requiring more teamwork and strategy (and less strength), tell the participants that they cannot throw the block of ice. They must instead melt the shirt out of the ice."]},{"name":"Expectation Circle","outcomes":["Leadership","Reflection"],"concept":"Team Builders","supplies":"None","time":"5-10 Minutes","groupsize":"Any","goal":"Participants learn more about each other and connect on a personal level. Participants open up to the group. Participants speak in front of a group.","facilitation":["Participants form a circle. Can be used before almost ANY activity","Participants discuss their expectations for the activity – what they expect of each other, ground rules, what they expect to gain from the activity."]},{"name":"Help! Rope Maze Challenge!","outcomes":["Leadership Skills","Social Cognition","Sense of Community"],"concept":"Leadership","supplies":"Rope, blindfolds","time":"20 minutes","groupsize":"Any","goal":"Participants learn to appreciate help when reaching goals.","facilitation":["Without participants seeing, create a maze out of rope. Have one starting point, then wrap the rope around whatever you can: Poles, tables, chairs, etc. When you tie ropes together, you can have them go in various directions. Tie the ends of the rope together, so it is continuous.","Explain the following rules: Each participant will be brought over to a rope maze. Each participant should grab onto the rope maze with at least one hand. They must feel along the rope until they have exited the maze. (Note: Be vague! If someone asks how they will know when they have exited the maze, say, “Trust me, you’ll know.”) Tell the participants that at least one hand must be on the rope at all times. Tell them that different participants may be going different directions through the maze. Tell them that it is okay to pass other participants, as long as at least one hand remains on the rope at all times. Tell the participants that if, at any time throughout the maze, they need help, they should raise their hand. (Again, be vague! If somebody asks what kind of help you can give, say, “I’ll help if you raise your hand.”) Finally, after explaining all the previous rules, tell participants that they will be blindfolded!","After explaining the rules of the activity, blindfold each participant. Some may need two blindfolds.","Walk each participant over to the maze. Place one of their hands on the rope. Ask them to wait there while you get other participants.","Once all the participants are holding rope, tell the participants that they can begin. Sit back while the participants attempt the maze.","If any participant raises his or her hand, quietly remove them from the maze. Take off their blindfold and whisper to them, “Shh… You’re out of the maze.”","Periodically remind the group, “If you need help, raise your hand.”","When participants have completed the maze, lead them in debriefing. Do everything possible to allow each participant to exit the maze. However, if time runs out and you absolutely positively cannot wait for participants to exit the maze, say, “I bet if you raise your hand to ask for help you can find your way out.” If they still do not ask for help, tell them to take off their blindfolds. Nonetheless, this activity works much better if every participant finds their own way out by asking for help themselves, even if it takes longer.","Make sure to let participants know that this activity was not done to humiliate anybody and apologize if anybody feels embarrassed."],"debrief":["What assumptions did you make?","How did your handicap affect your likelihood to ask for help?","What kept you from asking for help sooner?","What are some ways we can apply the lessons learned in this activity to STLF and [school name]?"],"images":["rope1.png","rope2.png","rope3.png","rope4.png","rope5.png","rope6.png"]},{"name":"Double Take","outcomes":["Leadership Skills","Social Awareness","Affection for Others","Collective Action","Sense of Community"],"concept":"Leadership","supplies":"None","time":"15 minutes","groupsize":"Medium to large","goal":"Participants find effective ways to communicate their ideas amongst the entire group and to ensure that everybody’s voice is heard.","facilitation":["Participants should stand up and spread out.","Participants should pair up, introduce themselves, and shake hands.","The facilitator should read out a characteristic (for examples, see below). Participants should find someone else who shares the characteristic, introduce themselves, and shake hands. The characteristics go from visual characteristics to characteristics that require verbal communication. Pay especially close attention to how the group interacts during the characteristics requiring verbal communication. Many will just yell and scream over each other, and you should bring this up during debriefing.","Debrief and reflect!"],"characteristics":["Hair Color","Eye Color","Shoe Size","Age (or year in school)","Favorite color","Favorite pizza topping","Pet ownership","Major (or dream career)"],"debrief":["What assumptions did you make? (We didn’t make assumptions; That we needed to hurry; etc.)","Why did you try to do this so quickly? (We thought it was a race; We wanted to meet new people; Everyone else was moving fast; etc.)","Towards the end, characteristics were less visible and required more verbal communication. When this happened, what was your strategy? (We just yelled; We took turns yelling; etc.)","How well do you think you did?","What would you do differently next time?"]},{"name":"Connections Are Everywhere!","outcomes":["Social Awareness","Affection for Others","Sense of Community"],"concept":"Diversity","supplies":"None","time":"10 minutes","groupsize":"At least ten, less than 35","goal":"Participants learn the similarities that connect them.","facilitation":["One volunteer participant (or the facilitator) stands up and begins to talk about unique things about themselves.","When another participant finds a similarity, they should get up and link arms with the original participant. If more than one person finds the same similarity, only one should link arms (just pick one, or use rock, paper, scissors).","The new participant begins to talk about unique things about themselves.","Repeat steps two and three until everyone is connected.","The last participant should then try to find a similarity to link themselves up to the original participant, making a complete circle.","The facilitator should say, in a SUPER cheesy voice, “See… Even though we are all different, we all have similarities that bond us together!”"]},{"name":"First Impressions","outcomes":["Reflection","Social Awareness","Affection for Others","Sense of Community"],"concept":"Diversity","supplies":"Pictures of people (not famous) in neutral settings","time":"15 minutes","groupsize":"At least ten, less than 25","goal":"Participants learn how strong first impressions can be. They learn to get to know each other before making judgments.","facilitation":["Divide participants into teams. Teams should be about five members each.","Give each team four to six pictures.","The teams should discuss for six minutes their first impressions of the people based only on what they see in the picture.","Each team should report to the large group on one of the pictures they felt the strongest first impression.","Debrief and reflect!"],"debrief":["How easy was it to agree on your first impression?","Was there disagreement among the team members? What were some of the reasons for disagreement? (Different upbringing; Different history with a certain kind of look; etc.)","What judgments do we make based on the way people look?","What judgments do others make about us and the way we present ourselves?","When are first impressions important?","Why is it important for us to get to know somebody before judging them?"],"alterations":["Have each group determine the career and salary of each picture."]},{"name":"Similarities and Differences","outcomes":["Affection for Others","Sense of Community","Social Awareness"],"concept":"Diversity","supplies":"One copy of the “Similarities and Differences” handout per person","time":"10 minutes","groupsize":"At least ten","goal":"Participants learn more about each other and connect on a personal level. Participants learn to become open with the group.","facilitation":["Give each participant a handout (below).","Participants mingle and have ten minutes to complete the grid by finding participants and discovering one similarity and one difference for each."]},{"name":"Four Corners","outcomes":["Social Awareness","Affection for Others","Sense of Community"],"concept":"Diversity","supplies":"None needed, but this activity works best if you have four pieces of paper (one that says, “Strongly Agree,” one that says “Agree,” one that says “Disagree,” and one that says “Strongly Disagree”).","time":"15 minutes","groupsize":"At least ten","goal":"Participants begin to learn a more broad definition of diversity. They learn that everybody has different values.","facilitation":["Identify four corners of a room. Tell participants that one corner is “Strongly Agree,” one corner is “Agree,” one corner is “Disagree,” and one corner is “Strongly Disagree.” If you have signs to designate each corner, lay them out now.","Tell participants that you will read out statements, and that they should move to the appropriate corner of the room based on whether or not they agree with the statements. Tell them that they must choose one corner, and that they cannot be in the “middle.” Tell participants that if they change their mind as they discuss each statement, they are allowed to move.","Read a statement (below).","Once participants move, ask one or two members from each corner to explain why they have chosen that corner.","Repeat steps three and four until all the statements have been read (or until time runs out… Remember to leave enough time for reflection)!","Debrief and reflect"],"debrief":["When scenarios were vague, how easy or difficult was it for you to interpret the scenario for yourself?","How did it feel visualizing your values or morals?","How did it feel when you were in a group with many other people?","How did it feel when you were in a group by yourself, or with very few other people?","What did this activity reveal about values and perspectives?","Why is it important to be aware of other peoples’ beliefs?","What is the difference between tolerating a belief and embracing a belief?"],"statements":["It is okay to drive 70 mph in a 55.","It is okay to drive 30 mph in a 30 mph school zone.","I would not say anything if McDonald’s only charged me for one of my fry orders, when I actually ordered two.","I would steal for my family if we couldn’t afford food.","I will let my children watch TV and play video games.","I would turn in a friend for cheating.","It is okay to download music without paying.","It is okay to date a friend’s ex- boyfriend or girlfriend."]},{"name":"Honesty Line","outcomes":["Social Awareness","Affection for Others","Sense of Community"],"concept":"Diversity","supplies":"None","time":"10 minutes","groupsize":"At least ten","goal":"Participants make human connections based on similarities and make human connections with stereotyped groups.","facilitation":["Participants form a line. If space is tight, they can form a circle, but there should be reasonable amounts of room in between each participant.","Participants close their eyes. Tell participants that, throughout the activity, they may be revealing information about themselves, and that if they do not feel comfortable revealing information about themselves, they should remain standing silently. Tell participants that even though their eyes are closed, others may have the opportunity to see them.","The facilitator reads the statements below.","After each statement is read, participants who believe they are a member of that group step forward.","After participants step forward, the facilitator may have everybody open their eyes, just the people who stepped forward, or just the people who stepped back. Participants that opened their eyes should establish eye contact, step back, and close their eyes.","After all the statements have been read, debrief and reflect."],"debrief":["How did it feel to step up, not knowing if anybody else would step up with you?","How did it feel to establish a secret connection with people with similarities?","Would you be more or less likely to step up if you did not have your eyes closed?","How did it feel when you were in a group with many other people?","How did it feel when you were in a group by yourself, or with very few other people?","What did this activity reveal about values and perspectives?","Why is it important to be aware of other peoples’ beliefs?","What is the difference between tolerating a belief and embracing a belief?"],"statements":["Step forward if your favorite music genre is country.","Step forward if your preferred method of communication is email.","Step forward if you were involved in you high school’s student council.","Step forward if you are from what you would consider a small town.","Step forward if you have ever attended private school.","Step forward if you are a member of a Greek-lettered affiliated organization.","Step forward if you would consider yourself an athlete.","Step forward if you would consider yourself overweight.","Step forward if your parents did not go to college.","Step forward if you consider yourself religious."]},{"name":"Accountability Partners (AKA Accountabilabuddies)","outcomes":["Leadership Skills","Reflection","Social Awareness","Affection for Others","Social Cognition"],"concept":"Reflection","supplies":"None (paper optional to pair up)","time":"No limit","groupsize":"Any","goal":"Participants make more intense connections allowing for deeper reflection.","facilitation":["Participants are paired up (ideally, pair up male participants with male participants and female participants with female participants). You can do this any way you’d like, from the simple to the complex. If you’re looking for a unique way to pair people up, consider coming up with a list of famous pairs (i.e. ketchup-mustard, Homer-Marge, peanut butter-jelly, Mary Kate-Ashley, etc.). Write one name per piece of paper. Give each participant a piece of paper, and they have to find their pair without blatantly saying what is written on their paper (i.e. “Eat me on sandwiches, I’m red, etc.”).","Periodically (i.e. once a night, etc.) accountability partners meet to discuss their experiences, days, backgrounds, WHATEVER! Anything goes! Meeting with accountability partners is a perfect way to end an evening… Whenever they finish, they’re done for the night."]},{"name":"Soundtrack (or Title Track) of Your Life","outcomes":["Leadership","Reflection","Sense of Community"],"concept":"Reflection","supplies":"None","time":"30+ minutes depending on group size.","groupsize":"10+","goal":"Participants have the opportunity to reflect on their lives or their present feelings.","facilitation":["NOTE: This activity needs some sort of transition to pass along from one participant to the next, because the activity is not intended to be done with no complimentary components. A participant begins by choosing a song that describes their current feelings or reflections.","Based on the transition method, this participant will choose the next person, and the cycle will continue until the activity comes to an end."]},{"name":"Letter to Self","outcomes":["Leadership","Reflection","Social Awareness","Sense of Community"],"concept":"Reflection","supplies":"Paper and Writing Utensils","time":"20+ minutes","groupsize":"Any size.","goal":"Participants have the opportunity to reflect on their lives and\/or their present feelings through writing. Too many times, participants do not take time to write about their feelings, the sense of community they have felt, or the things they have learned while on a tour. Setting aside a special time to allow participants to jot down a few things that will be read at a later date will allow them to remember these special times in the future when they receive their letters.","facilitation":["Have participants spread out on the ground, turn on quiet music, and give a short recap of what has happened throughout the past week. Explain how things always happen so fast, but in order to take everything in, it helps to write things down and reflect on the experience.","Facilitators distribute papers and writing utensils, and envelope to each participant.","Facilitators should instruct the group to write their mailing addresses on the outside of the envelope. Here, they should explain that they will be mailing the letters that participants write to themselves back to them after a 6-8 month period.","Then, Participants reflect on their experience quietly by writing a letter to themselves."]},{"name":"Self Concept Quiz","outcomes":["Reflection"],"concept":"Reflection","supplies":"1 copy of the self Concept Quiz per participant (see below)","time":"25 minutes","groupsize":"Medium to large","goal":"Participants learn that they all have struggles and things that they are proud of.","facilitation":["Early in the week, give participants the Self Concept Quiz. Collect the quizzes and leave them anonymous.","During the week, go through the quizzes and highlight one response per sheet.","Towards the end of the week, bring participants into a room with candles and dim lighting. Make sure the participants are ready for a serious activity. As participants are entering the room, they should be silent. The participants should be silent for the duration for the activity. The participants should sit at a station with paper and a pen.","One at a time, facilitators should read the highlighted responses.","After all the responses are read, participants should be allowed to write on the paper their Believe Statements.","After a few minutes of allowing participants to write their Believe Statements, allow participants to share, if they would like."],"images":["self_concept1.png","self_concept2.png"],"doc":["Self Concept Quiz","https:\/\/docs.google.com\/document\/d\/1ope5xJQYzpP76Udiuuv2mI7P2WF1JtEg8M7fyTLU8N8\/edit?usp=sharing"]},{"name":"Secret Letter from Parents\/Friends","outcomes":["Social Awareness","Leadership","Sense of Community"],"concept":"Reflection","supplies":"None","time":"30+ minutes depending on group size.","groupsize":"20+","goal":"Participants are deeply affected by this unexpected and emotional activity. The goal is for the participants to hear a meaningful piece of writing from a family member, guardian, or close friend that leaves a special mark on their heart in an open, safe, and familial-like atmosphere. This is great for retreats, tours, or camps, and should be treated as one of the more emotional, “serious” activities.","note":"**Facilitation of this activity begins at least one month in advance. It is very important that facilitators are responsible in tracking down all of participants close friends\/guardians and keeping this a secret!","facilitation":["Facilitators get a list of parent emails from participants in a deceiving but appropriate way.","Facilitators send out emails to parents\/close friends of participants asking for a secret piece of writing that is NO MORE than 250 words describing the participant. They explain in the email that this is secretive and must be a positive note. They also explain their goals for the activity to the writer. They inform the writer that they can either email them back the piece, or mail it in.","Facilitators collect all the letters and distribute them amongst each other evenly. Then, each facilitator reads the letters to practice articulation.","On the day of the activity, facilitators set a serious tone at night by executing a proper transition into a space for the activity, such as a trust walk.","In a dark room, participants will use flashlights to shine light on their letter, and one facilitator will explains what is taking place.","Then, facilitators take turns shining light on their letters, announcing the name of whom the letter is for, and then reading the letter aloud.","After reading each name, the facilitator should turn off his\/her flashlight leaving the room in complete darkness until the next facilitators turns his\/her flashlight on. The process continues until all letters are read."]},{"name":"Words of Wisdom **Reserved for Leadership Camp**","outcomes":["Leadership Skills","Reflection"],"concept":"Reflection","supplies":"Music-playing device","time":"1-2 hours","groupsize":"Any","goal":"Participants open up to the group, practice public speaking skills; listeners get an opportunity to learn from their leaders","facilitation":["Speakers share a short story\/message","Speakers play a meaningful song to accompany their message","Speakers distribute an object to every listener that appropriately accompanies their message, much like “40 Things” on the Tour."]},{"name":"Silent Affirmations\/Shoulder Tap","outcomes":["Reflection","Sense of Community"],"concept":"Positive Affirmation\/Recognition","supplies":"None","time":"20 minutes","groupsize":"At least ten, the more the better!","goal":"Participants give and receive anonymous praise.","facilitation":["Assemble the group into a circle (everyone sits facing away from the circle).","Have everyone close his or her eyes. Also, nobody should speak for the duration of the activity.","The facilitator should be in the center of the circle. He or she should tap several members of the group. These members should open their eyes and come to the center of the circle, but remain silent.","The facilitator reads some of the silent affirmations (below). The participants in the center should tap a many people as applicable on the back.","Have the participants return to the circle and close their eyes.","The facilitator should select several new members and repeat steps three through five.","This activity continues until all participants have been given a chance to be in the center, and until all statements are read.","REMEMBER TO CLARIFY WHICH STUDENTS ARE BEING SELECTED TO STAND UP BETWEEN WHICH STUDENTS SHOULDERS ARE BEING TAPPED FOR THE AFFIRMATION PORTION OF THE ACTIVITY!"],"statements":["You want to thank, but have not.","You have especially enjoyed getting to know this year.","Have helped you out when you were stressed out.","Have influenced you to work on bettering yourself.","You hope you don’t lose touch with in the future.","You admire.","Have surprised you this year.","You hope to get to know better.","You feel are quiet leaders.","You think are good listeners.","You think are good about looking out for the underdog.","You would go to when you need a boost.","’s shoulder you’d cry on.","You would go on a road trip with.","You’d like to see speak out more.","You think are future leaders.","You think are creative.","Makes you laugh or lifts your spirits.","Have more to offer.","You feel a connection with.","You’d like to spend more time with.","Have been there for you.","Are mentors to you but may not know it.","’s opinion you value highly.","You would seek out for advice.","You would want on your plane if it was going down.","’s humor you appreciate.","You think always have a good attitude.","Are good listeners.","Could relax and have fun more often.","You enjoy doing work with.","You feel somewhat distant from.","You would feel comfortable sharing a secret with.","Have helped you when you really needed it.","Have inner strength.","Are always in a great mood.","Interests you.","Have a positive effect on you.","Put in a lot of effort.","You think could open up more.","Work well with different individuals.","Have done something to make you smile.","You feel could be more assertive.","Are always funny and makes you laugh.","You have shared a good experience with.","You would feel safe crying with.","Are well rounded individuals.","You feel are very important to you.","Are very motivated.","You would like to share more with.","You would like to be more like.","Are great friends.","Could interact more.","Make you feel good about yourself.","Show enthusiasm.","Have supported you.","Inspire you.","Challenge you."]},{"name":"This Is A Person…","outcomes":["Warm and Fuzzy"],"concept":"Positive Affirmation\/Recognition","supplies":"Paper, Pens, Markers, all optional","time":"If using paper, 30-40 minutes. If choosing to do verbally, 45 minutes to 1 hour.","groupsize":"Entire Bus, 30-40","goal":"To allow participants to realize they have impacted someone else’s life. If done verbally, participants are able to know who is looking up to them. If done silently with paper, students anonymously compliment one another.","facilitation":["Pass around paper and writing utensil.","Can decide to set the atmosphere with quiet music and candles if desired.","Give a brief opening statement such as, “Throughout these past days, you have all impacted someone’s life on this bus whether you know it or not. It is not always easy to express how much you have grown to appreciate a new or old friend, but tonight as we do this activity, you will be given the chance to anonymously tell each person on the bus how they have affected you.”","Have each person write their name in the middle of the paper and include a drawing if so desired.","To begin, have everyone pass their paper to the person on their left. At this time they will no longer see their own paper, but each paper will be passed around the entire circle so that everyone has a chance to write a word or phrase about each new friend they have made.","To end, allow about 5-10 minutes for students to read over their paper and close with brief questions to let them think about how they felt while reading their own paper."],"verbal":["Have entire group form into a circle, with the ability to see everyone. ","Each person will be the first to answer one question, after they have answered, the person to their right will then say the name of an individual on the trip who the question applies to. After completing the entire circle, allow participants to come up with a few of their own questions.","Questions usually go from funny and light, to more serious."],"questions":["This is someone who makes me laugh.","This is someone who I will talk to at school more.","This is someone who I want to take care of my kids.","This is someone who I would want to throw me a surprise party.","This is someone who I would trust with my love life.","This is someone who I would want to travel the world with.","This is someone who impacted my life.","This is someone who makes me smile.","This is someone whose laugh I enjoy.","This is someone who I believe in.","This is someone who I want to have coffee with.","This is someone who I want to go shopping with.","This is someone I could be stranded on a desert island with.","This is someone whose conversations I enjoy.","This is someone I would go to the movies with."]},{"name":"Name-An-Inspiration Transition","outcomes":["Leadership","Reflection","Affection for Others","Sense of Community"],"concept":"Positive Affirmation\/Recognition","supplies":"None","time":"2 mins per transition \/ total time depends on activity.","groupsize":"10+","goal":"The main goal of this activity is to give participants the opportunity to reflect on their STLF experience by choosing a person within the circle that has served as an inspiration or role model, thereby creating a special bond with that person as well as an overall sense of unity with the present group. This type of transition creates special memories for the experience.","facilitation":["It is important to note that the Name-an-inspiration Transition is one of a few transition-techniques that STLF uses during group activities. Therefore, this particular transition can be applied to quite a few different activities and the facilitation can be tailored according. For the most part, this transition-technique would occur after forming a circle.","Beginning with a national core member or facilitator, choose a person who you see as a role model, inspiration, or who has impacted you and explain why this person has left a special mark on you.","The person you speak about will choose another person and the process will repeat until the end of the activity."]},{"name":"(The Famous, Illustrious) YEAH BUDDIES!","outcomes":["Affection for Others","Leadership","Reflection","Sense of Community"],"concept":"Positive Affirmation\/Recognition","supplies":"None","time":"No more than 10 minutes.","groupsize":"Any size. Even self-yeah buddies exist!","goal":"Participants get a chance to recognize others in a group and create a time for reflection, group bonding, relationship-building, and a special type of fun that is unique to the STLF culture!","facilitation":["Form a circle","The Yeah Buddies begin. The standard format for a Yeah Buddy is: “I’d like to give a Yeah Buddy to (name) for (whatever).","The cycle continues until it is an appropriate time to stop!"]}] 